### --- Utilities ---
brew "git"
brew "cowsay"
brew "fortune"
brew "thefuck"
brew "tree"
brew "mas-cli/tap/mas" # Required for mac app install from CLI
brew "speedtest-cli"
brew "zoxide" 

### --- Applications ---
cask "iterm2" 
cask "docker" 
cask "insomnia" 
cask "spotify" 
cask "iina" 
cask "whatsapp" 
cask "zoom" 
cask "firefox" 
cask "googl-chrome" 
cask "alfred" 
cask "grammarly"
cask "rectangle"
cask "alt-tab"
cask "visual-studio-code"
cask "maccy" 
cask "jetbrains-toolbox"
cask "caffeine"
cask "plex"
cask "notion"


mas "trello", id: 1278508951
mas "bitwarden", id: 1352778147 # Need to use app store for web auto-comp functionality


### --- Optional ---
cask "ferdium" # TBD if i'm still using this in the future...
cask "betterdisplay" # Only if using LG 42
cask "hammerspoon" # Only if using LG 42
brew "wakeonlan" # Only if using LG 42 and hammerspoon
cask "ogi-options-plus" # Only if using logitech mouse



